{
  "projects": [
    {
      "id": 1,
      "order": 1,
      "name": "Fantazina",
      "shortDescription": "Create Your Own Fantasy League",
      "description": "Fantazina is a fully integrated fantasy sports platform designed to offer a complete and competitive experience. It allows users to create and manage leagues, build teams, track player performance, and compete across rounds using dynamic scoring and customizable rules. The system supports league setup and management, team building, budgets, transfers, captain choices, bench options, and round updates. Match events such as goals, assists, cards, and penalties are recorded and automatically converted into player points. Users and league owners can view rankings, statistics, and performance through clear and organized dashboards. Fantazina also includes a full communication system for tickets and messaging, along with secure authentication features like OTP verification and password recovery. Overall, it functions as a complete fantasy sports ecosystem that manages everything from league creation to real-time scoring.",
      "techStack": ["PHP", "Laravel", "HTML", "Twilio", "CSS", "JavaScript", "MySQL"],
      "link": "https://fantazina.com",
      "thumbnail": "assets/fantazina/1.png",
      "images": [
        "assets/fantazina/1.png",
        "assets/fantazina/2.png",
        "assets/fantazina/3.png",
        "assets/fantazina/4.png",
        "assets/fantazina/5.png",
        "assets/fantazina/6.png",
        "assets/fantazina/7.png",
        "assets/fantazina/8.png"
      ]
    },
    {
      "id": 2,
      "order": 2,
      "name": "Skorka",
      "shortDescription": "Full-stack shopping solution",
      "description": "Skorka is a footwear e-commerce application designed to provide users with a seamless online shopping experience. It allows customers to browse and search products, add items to their cart, and complete secure purchases with ease. The platform also supports product categorization, user authentication, and order management, making it efficient for both customers and administrators. With its clean design and intuitive interface, Skorka simplifies footwear shopping and enhances overall user satisfaction.",
      "techStack": ["PHP", "Laravel", "HTML", "WebSockets", "CSS", "JavaScript", "MySQL"],
      "link": "https://skorkaa.com",
      "thumbnail": "assets/skorka/1.png",
      "images": [
        "https://i.ibb.co/8D52ZD51/1.png",
        "https://i.ibb.co/ycM4DzCt/2.png",
        "https://i.ibb.co/1Yy7MChm/3.png",
        "https://i.ibb.co/CTHG72v/4.png",
        "https://i.ibb.co/sp02pY1X/6.png",
        "https://i.ibb.co/Xrx83kbN/5.jpg",
        "https://i.ibb.co/XrD13pJ0/7.png"
      ]
    },
    {
      "id": 3,
      "order": 3,
      "name": "Scouters Management System",
      "shortDescription": "Scouts registration and activity management system",
      "description": "The Scouters Management System is a web application that streamlines the process of handling scout registrations, managing activities, and monitoring performance. It enables leaders to organize events, track participation, and maintain structured records, while also providing reports that support better decision-making. With its simple interface and efficient workflows, the system reduces manual effort and improves overall coordination between scouts and leaders.",
      "techStack": ["PHP", "Laravel", "HTML", "WebSockets", "CSS", "JavaScript", "MySQL"],
      "link": "https://github.com/KarimEssac/Scout_Management_System",
      "thumbnail": "assets/scout/2.png",
      "images": [
        "https://i.ibb.co/h1hDqZKn/2.png",
        "https://i.ibb.co/z18PxGs/3.png",
        "https://i.ibb.co/zhW9j5Gn/7.png",
        "https://i.ibb.co/WNjhj4K5/4.png",
        "https://i.ibb.co/BKCBTdMr/5.png",
        "https://i.ibb.co/R4VvnRXQ/1.png",
        "https://i.ibb.co/7x6nKmjs/6.png"
      ]
    },
    {
      "id": 4,
      "order": 4,
      "name": "Ticket Reservation System",
      "shortDescription": "Ticket reservation and total revenue system",
      "description": "The Ticket Reservation System is a full-stack web application for creating and managing events, venues, and seat reservations. It provides an interactive seat map for users to select seats, real-time availability to prevent double bookings, secure order processing, and electronic ticket issuance. The admin dashboard enables organizers to create events, configure seating layouts and prices, manage bookings and refunds, and view detailed analytics and reports on sales, occupancy, and revenue. The system supports user accounts, order history, and role-based access for staff and administrators.",
      "techStack": ["Angular", "PHP", "Laravel", "HTML", "CSS", "JavaScript", "MySQL", "WebSockets", "Stripe (or other payment gateway)"],
      "link": "#",
      "thumbnail": "assets/bi_anglos/1.png",
      "images": [
        "assets/bi_anglos/1.png",
        "assets/bi_anglos/2.png",
        "assets/bi_anglos/3.png"
      ]
    },
    {
      "id": 5,
      "order": 5,
      "name": "Pharaonic Bank",
      "shortDescription": "Full-stack banking management system",
      "description": "Pharaonic Bank is a full-stack web application developed as a student project to simulate real banking operations. It provides core features such as user account creation, secure authentication, balance tracking, transactions, and fund transfers. The system also supports admin management for overseeing users and operations. Designed with a structured backend and an intuitive frontend, it demonstrates how technology can streamline banking processes while offering students hands-on experience in building scalable financial applications.",
      "techStack": ["PHP", "Laravel", "HTML", "WebSockets", "CSS", "JavaScript", "MySQL"],
      "link": "",
      "thumbnail": "assets/bank/1.png",
      "images": [
        "https://i.ibb.co/KxgH7FFQ/1.png",
        "https://i.ibb.co/4Sxc11yG/4.png",
        "https://i.ibb.co/3R4d4V8r/2.png",
        "https://i.ibb.co/yWDbTXR9/3.png"
      ]
    }
  ]
}